from django.test import TestCase

from wxcloudrun.apps.message.domain.chain_message_reminder.chain_message_reminder_service import \
    ChainMessageReminderService
from wxcloudrun.apps.message.models import Message


class ChainMessageReminderServiceTest(TestCase):
    test_msgs = [
        '#接龙\n早上好呀\n\n1. 和尚 6-9.30 -7.43 扣手机洗漱咖啡清理随手记安排今日 -8.30 出门去公司边吃早餐边群里摸鱼 -9.30 为工作调试东西（意识到单测重要性）\n2. 大京 6-9\n-7:00准备早餐&科目一\n-7:45洗漱早餐赶路\n-8:05微信\n-9:00《认知觉醒》&微信聊天\n3. 吃可爱长大的🐑 6:11\n-6:16上厕所（计时）\n-6:40吃早饭\n-7:00耍手机\n-7:20微信读书\n-7:40洗漱出门\n4. Bean 6:16\n-06:30【主业】回工作消息\n-07:10【生活】洗漱 塞尔达\n-07:28【主业】回工作消息\n-08:04【副业】Youtube听写\n-09:05【生活】通勤+复习不背单词+继续看Makudo的视频\n-09:17【生活】吃早饭\n-09:38【生活】昨日总结+今日计划+吐槽\n5. 琴子 Miyo  6.35  6.40-7.20听力 7.25-7.35冥想🧘‍♀️ 7.40-8.15洗漱收拾出门\n6. 林🌘 6:38-7:44\n-6:38-7:05 洗漱，整理\n-7:05-7:08 思考什么时候去公司\n​-7:08 出门\n​-7:30 在地铁上看视频学习\n​-7:44 到公司，早餐\n7. 丁达尔效应 6.50\n-7.00 扣手机唤醒\n-7.30 洗漱\n-8.20 《当下的力量》笔记\n-9.10 《认知觉醒》第二章\n-9.40 《秘书工作手记》\n8. Kevin_涛 7-10\n-8 健身\n-9 洗漱，吃饭，整理衣服\n-9.30 厕所，冥想，学习英语\n-10 看书《百年孤独》\n9. Y.jun 7\n-7:30收拾出门体检\n10. 大螃蟹 7:00–8:40\n–7:25 玩手机，洗漱收拾\n–8:00 做早餐，吃早餐，洗碗\n-8:40 阅读《伦敦最后一家书店》\n11. 笑眼 7:00\n-7-7:25洗漱\n-7:28-7:46吃早饭\n-7:50-8:30复习昨天学习内容\n-8:42出门\n12. 李庆 7:08\n13. 小狐狸 7:05\n-7:40 听音乐洗漱看基金\n-8:15出门到公司\n-8:45早餐\n-9:15八段锦\n-10:00看资料准备开工\n14. Ronronner 7:15\n-7:30起床撸猫洗漱\n-8:00半小时漫画经济学2\n-8:50化妆收拾出门\n-9:30通勤+认知觉醒\n今天认知觉醒比较触动的点\n科学的学习策略是产出作品、获取反馈，驱动本能脑和情绪脑去“玩玩玩”，而不是一味地努力坚持，让理智脑苦苦地去“学学学”\n15. RitaLiu念念 7:15\n7.20洗漱\n8.10出门\n8.30地铁读书\n16. io 7：22\n7：30看动漫\n8：50-9:40看增删\n17. 凉 7:25\n- 8:15 称体重、洗漱吃饭、收拾家\n- 9:05 1\n- 10:00 通勤到公司开始上班\n18. 十点以后就睡觉了 7:31\n19. 小柒 7:31\n-8 玩手机\n-8.15 铲屎晾衣\n-8.35 洗漱出门\n20. 影妹 7:35\n7:35-8:00 收拾昨天的行李，出门\n21. 乐颜 7.35—9.45\n-8.10洗漱 打扫卫生\n-8.20 吃饭\n-9.10 看书\n-9.45护肤出门\n22. runner 7：38\n-8：00洗漱\n-9：20学习上班\n23. FOUND404 7:40\n- 8:30 洗漱洗澡\n- 9:00 番茄时钟阅读\n- 9:10 出门上班\n24. shmily 7.42起床洗漱\n25. 李家鑫 8.00 -8.24 洗漱出门 -8.57 吃早餐到健身房 -10.22 健身 -10.30 到公司准备开始工作\n26. 西瓜（虽然但是还是记一下 8:10\n-8:30 弄早餐\n-9:10 洗漱收拾出门',
    ]
    for test_msg in test_msgs:
        message = Message(
            msg_id='MsgId',
            msg_type='MsgType',
            to_user_name='ToUserName',
            from_user_name='FromUserName',
            create_time='CreateTime',
            content=test_msg,
        )
        service = ChainMessageReminderService(message)
        handle_res = service.handle()
        print(handle_res)
